In [60]:
import pandas as pd
import numpy as np

In [61]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [62]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [63]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [64]:
df.loc[df.FlightNumber.isnull(),['FlightNumber']]=[10055,10075]

In [65]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [66]:
df['FlightNumber']=df['FlightNumber'].astype(np.int)

In [67]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [68]:
df[['From','To']]=df.From_To.str.split("_",expand=True)

In [69]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [70]:
df['From_To']=df['From_To'].str.capitalize()

In [71]:
df.drop('From_To',axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [72]:
delays = pd.DataFrame()

In [73]:
df.explode('RecentDelays')

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045,23,KLM(!),LoNDon,paris
0,London_paris,10045,47,KLM(!),LoNDon,paris
1,Madrid_milan,10055,NaN,<Air France> (12),MAdrid,miLAN
2,London_stockholm,10065,24,(British Airways. ),londON,StockhOlm
2,London_stockholm,10065,43,(British Airways. ),londON,StockhOlm
2,London_stockholm,10065,87,(British Airways. ),londON,StockhOlm
3,Budapest_paris,10075,13,12. Air France,Budapest,PaRis
4,Brussels_london,10085,67,"""Swiss Air""",Brussels,londOn
4,Brussels_london,10085,32,"""Swiss Air""",Brussels,londOn